from pathlib import Path
path = f"{Path.cwd()}"
def create():
     """
     Функция возвращает данные для создания файла, в котором хранится вся необходимая информация для игры "Бункер"
     """
     import random
     s = ("инженер ", "химик ", "строитель", "музыкант", "программист", "поп", "врач", "пожарный", "полицейский",
         "МЧСник", "уборщик", "офицант", "администратор", "икасатор", "учитель", "водитель", "космонавт", "электрик",
         "ювелир", "артист", "продавец", "инвестор")
     z = ("у вас Рахит", "у вас синдром Хрустального человека ", "у вас Булимия", "у вас Шизофриния",
         "у вас Делирий", "у вас рак", "у вас Плоскостопие", "у вас Психоз",
         "у вас СПИД", "у вас Covid-19", "у вас Гепатит-Б", "у вас Проказа", "у вас Ячмень", "у вас Альцгеймер",
         "у вас ",
         "у вас Грипп", "у вас Лешай")
     p = ("мужской ", "женский ")
     t = ("атлетичное", "полное", "худое")
     ch = ("экспрессивность", "впечатлительность", "жизнерадостность", "повышенная эмоциональность",
          "низкая эмоциональность", "импульсивность", "импрессивность", "неустойчивая  эмоциональность",
          "целенаправленность", "решительность", "настойчивость", "неуверенность", "смелость", "дисциплинированность",
          "самостоятельность", "рассудительность", "глубина и гибкость интеллекта", "находчивость",
          "математический склад ума", "легкомысленность", "сообразительность", "любознательность", "вдумчивость",
          "жесткость", "доброта",
          "отзывчивость")
     hu = (
     "лыжи", "пилатес", "футбол", "туризм", "компьютерные игры", "йога", "музыка", "готовка", "благотворительность",
     "бокс", "оригами", "видеосъемка", "дайвинг", "клининг", "ремонт автомобилей", "чтение", "просмотр фильмов",
     "изучение иностранных языков", "шахматы", "шашки", "кроссворды ", "настольные игры", "покер", "кубик рубика",
     "блогерство", "программирование ", "разработка сайтов", "пчеловодство", "дрессировка собак", "цветоводство",
     "астрология ", "выпечка", "виноделие", "дизайн", "аэрография", "писательская деятельность ", "ведение дневника",
     "моделирование", "гончарное дело", "вязание", "шитье", "садоводство", "тикток", "психология", "электрика")
     fs = ("Агризоофобия", "Аквафобия", "Акустикофобия", "Барофобия", "Блаттофобия", "Ботанофобия ", "Вагинофобия ",
          "Вакцинофобия", "Вермифобия ", "Вомитофобия ", "Гексакосиойгексеконтагексафобия", "Герпетофобия ",
          "Дементофобия",
          "Зоофобия", "Ипохондрия ", "Криофобия ", "Липофобия ", "Микофобия ", "Музофобия ", "Сеплофобия ",
          "Скиофобия ",
          "Спидофобия", "Термофобия ", "Уринофобия ", "Фтириофобия ", "Ценофобия ", "Электрофобия ", "Ятрофобия ",
          "Скотомафобия ", "Социофобия", "Гумафобия ")
     i = ("Коробок спичек", "Солнечная зажигалка", "Нож", "Швейцарский нож", "Кочерга", "Кастрюля", "Горелка", "Аптечка",
         "Салфетка", "Активированный Уголь", "Камуфляжный костюм", "Фильтр для воды", "Походное одеяло", "Зубная щетка",
         "Туалетная бумага", "Медицинский спирт", "Веревка", "Клубок ниток", "Батон белого хлеба", "5л воды",
         "Фрагмент карты", "Компас", "Часы", "Фонарь", "Бензин")
     spec1 = ("Изменение/добавление характеристик одному игроку", "Изменение характеристик всем игрокам",
             "Изменение катаклизма", "Изменения бункера", "Изменение еды в бункере", "Обмен характеристиками и кража",
             "Защита от вылета", "Защита от спец. возможностей")
     with open(f"{path}/bunker/BabyFile.txt", "w+") as my_file:
          my_file.write("Пол - ")
          my_file.write(random.choice(p))
          my_file.write(" \nТелосложение - ")
          my_file.write(random.choice(t))
          my_file.write(" \nЧеловеческая черта - ")
          my_file.write(random.choice(ch))
          my_file.write(" \nСпециальность - ")
          my_file.write(random.choice(s))
          my_file.write(" \nЗдоровье - ")
          my_file.write(random.choice(z))
          my_file.write(" \nХобби / Увлечение - ")
          my_file.write(random.choice(hu))
          my_file.write(" \nФобия / Страх - ")
          my_file.write(random.choice(fs))
          my_file.write(" \nИнвентарь - ")
          my_file.write(random.choice(i))
          my_file.write(" \nСпец. возможность - ")
          my_file.write(random.choice(spec1))
